# customer-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential-mzKRty]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=2941362221]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-2586101c-c461-42f8-9606-a9cceec03561]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-635a61de-3519-4e07-b108-372ade056c93]
module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Read complete after 1s [id=b18ffd3e4cbe812e076fb896621aa09a8ce561c6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/customer_processor_identity_v1_event"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer_processor_identity_v1_event"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy.lambda_secrets_policy[0] will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-customer_processor_identity_v1_event"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential-mzKRty"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer_processor_identity_v1_event"
    }

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/identity-v1-event/lambda.zip"
      + function_name                  = "customer_processor_identity_v1_event"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ahVDiphFKQxNl30pZkDeVlys4hM/K+3H65OVo+JyjAc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "customer_processor"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "33ae0d38-ac7c-4f6a-94a2-6dfeed0828ba"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*